In [1]:
import numpy as np

import pandas as pd

from pandas import Series,DataFrame

from sklearn.preprocessing import OrdinalEncoder,OneHotEncoder,LabelEncoder

from sklearn.neighbors import KNeighborsClassifier

In [20]:
salary = pd.read_csv('./salary.txt')
salary.drop(labels=['final_weight','education_num','capital_gain','capital_loss'],
            axis = 1,inplace=True)

In [21]:
ordinalEncoder = OrdinalEncoder()

data = ordinalEncoder.fit_transform(salary)

salary_ordinal = DataFrame(data,columns=salary.columns)
salary_ordinal.head()

    age  workclass  ...  native_country  salary
0  22.0        7.0  ...            39.0     0.0
1  33.0        6.0  ...            39.0     0.0
2  21.0        4.0  ...            39.0     0.0
3  36.0        4.0  ...            39.0     0.0
4  11.0        4.0  ...             5.0     0.0

[5 rows x 11 columns]

In [19]:
# LabelEncode（Series）和OrdinalEncode（DataFrame） 类似
labelEncode = LabelEncoder()

salary_label = labelEncode.fit_transform(salary['salary'])

for col in salary.columns:
    salary[col] = labelEncode.fit_transform(salary[col])
    
salary.head()

   age  workclass  ...  native_country  salary
0   22          7  ...              39       0
1   33          6  ...              39       0
2   21          4  ...              39       0
3   36          4  ...              39       0
4   11          4  ...               5       0

[5 rows x 11 columns]

In [28]:
edu.drop_duplicates().count()

education    16
dtype: int64

In [29]:
edu = salary[['education']]
edu

onehotEncoder = OneHotEncoder()

onehot = onehotEncoder.fit_transform(edu)

onehot

<32561x16 sparse matrix of type '<class 'numpy.float64'>'
	with 32561 stored elements in Compressed Sparse Row format>

In [34]:
edu

        education
0       Bachelors
1       Bachelors
2         HS-grad
3            11th
4       Bachelors
...           ...
32556  Assoc-acdm
32557     HS-grad
32558     HS-grad
32559     HS-grad
32560     HS-grad

[32561 rows x 1 columns]

In [36]:
np.sort(edu.education.unique())

array(['10th', '11th', '12th', '1st-4th', '5th-6th', '7th-8th', '9th',
       'Assoc-acdm', 'Assoc-voc', 'Bachelors', 'Doctorate', 'HS-grad',
       'Masters', 'Preschool', 'Prof-school', 'Some-college'],
      dtype=object)

In [32]:
# one - hot：独热
nd1 = onehot.toarray()[:10]
nd1

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.]])

In [33]:
nd1.argmax(axis = 1)

array([ 9,  9, 11,  1,  9, 12,  6, 11, 12,  9], dtype=int64)